app/controllers/commodities_controller.rb

SELECT "commodities".* FROM "commodities"
---
  def index
    @commodities = Commodity.all

INSERT INTO "commodities" ("name", "unit", "price", "exchange_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fadf"], ["unit", "fdasf"], ["price", 0.0], ["exchange_id", 2], ["created_at", "2021-12-03 01:56:28.939438"], ["updated_at", "2021-12-03 01:56:28.939438"]]
SELECT "exchanges".* FROM "exchanges"
---
  def create
    @commodity = Commodity.new(commodity_params)

    if @commodity.save
      exchanges = Exchange.all

SELECT "commodities".* FROM "commodities" WHERE "commodities"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "commodities" WHERE "commodities"."id" = ?  [["id", 6]]
SELECT "commodities".* FROM "commodities"
---
  def special_destroy
    # print(exchange_params[:name])
    # print(exchange_params[:id])
    # print(exchange_params)
    # exchange = Exchange.find(params[:id])
    commodity = Commodity.find(commodity_params[:id])
    if commodity.destroy
      # All commodities
      commodities = Commodity.all