app/controllers/currencies_controller.rb

SELECT "currencies".* FROM "currencies"
---
  def index
    @currencies = Currency.all

INSERT INTO "currencies" ("name", "c_type", "price", "exchange_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fdsaf;kl"], ["c_type", "sell"], ["price", 0.0], ["exchange_id", 27], ["created_at", "2021-12-03 02:25:35.695782"], ["updated_at", "2021-12-03 02:25:35.695782"]]
SELECT "exchanges".* FROM "exchanges"
---
  def create
    @currency = Currency.new(currency_params)

    if @currency.save
      exchanges = Exchange.all

SELECT "currencies".* FROM "currencies" WHERE "currencies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "currencies" WHERE "currencies"."id" = ?  [["id", 4]]
SELECT "currencies".* FROM "currencies"
---
  def special_destroy
    # print(exchange_params[:name])
    # print(exchange_params[:id])
    # print(exchange_params)
    # exchange = Exchange.find(params[:id])
    currency = Currency.find(currency_params[:id])
    if currency.destroy
      # All commodities
      currencies = Currency.all

SELECT "currencies".* FROM "currencies" WHERE "currencies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_currency
      @currency = Currency.find(params[:id])