app/controllers/exchanges_controller.rb

SELECT "exchanges".* FROM "exchanges"
---
  def index
    @exchanges = Exchange.all

INSERT INTO "exchanges" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Danny"], ["created_at", "2021-12-02 23:46:56.037999"], ["updated_at", "2021-12-02 23:46:56.037999"]]
SELECT "exchanges".* FROM "exchanges"
---
  def create
    @exchange = Exchange.new(exchange_params)
    if @exchange.save
      exchanges = Exchange.all

SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "commodities".* FROM "commodities" WHERE "commodities"."exchange_id" = ?  [["exchange_id", 2]]
DELETE FROM "commodities" WHERE "commodities"."id" = ?  [["id", 2]]
SELECT "commodities".* FROM "commodities" WHERE "commodities"."exchange_id" = ?  [["exchange_id", 1]]
SELECT "currencies".* FROM "currencies" WHERE "currencies"."exchange_id" = ?  [["exchange_id", 2]]
DELETE FROM "currencies" WHERE "currencies"."id" = ?  [["id", 2]]
DELETE FROM "exchanges" WHERE "exchanges"."id" = ?  [["id", 2]]
SELECT "exchanges".* FROM "exchanges"
---
  def special_destroy
    # print(exchange_params[:name])
    # print(exchange_params[:id])
    # print(exchange_params)
    # exchange = Exchange.find(params[:id])
    exchange = Exchange.find(exchange_params[:id])
    # Iterate over each commodity
    exchange.commodities.each do |commodity|
      commodity.destroy
    end
    # Iterate over each currency
    exchange.currencies.each do |currency|
      currency.destroy
    end
    if exchange.destroy
      exchanges = Exchange.all

SELECT "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_exchange
      @exchange = Exchange.find(params[:id])