app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dan@test.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by :email=>params[:email]